#lang sicp

#|review: ignore|#

; (list 1 (list 2 (list 3 4)))
; (1 (2 (3 4)))
;
; Представление в виде списка
; (1 (2 (3 4)))
;
; 1 ----> | nil
; ---     ------
;         }  
;         |    2  ----> } nil
;         }->  ----     ----
;                       |
;                       |   3 ------> 4 nil
;                       |-> ---      -----
;                   
; Представление в виде дерева
; (1 (2 (3 4)))
;    |
; 1-----|
;       |
;     |---|
;     2   |
;         |
;      |-----| 
;      3     4